1. Simple Calculations 

Scenario: You have a dataset with product prices and quantities sold. 

Goal: Calculate the total revenue generated for each product by multiplying price by quantity

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('task1data.csv')

In [4]:
df

     Product  Price ($)  Quantity Sold
0  Product A         10            100
1  Product B         20             75
2  Product C         15            120
3  Product D         25             50
4  Product E         30             80
5  Product F         12             90
6  Product G         18            110
7  Product H         22             65
8  Product I         27             85
9  Product J         14             95

In [10]:
df['Revenue'] = df['Price ($)']*df['Quantity Sold']

In [11]:
df

     Product  Price ($)  Quantity Sold  Revenue
0  Product A         10            100     1000
1  Product B         20             75     1500
2  Product C         15            120     1800
3  Product D         25             50     1250
4  Product E         30             80     2400
5  Product F         12             90     1080
6  Product G         18            110     1980
7  Product H         22             65     1430
8  Product I         27             85     2295
9  Product J         14             95     1330

 2. Extracting Information from Strings 

Scenario: You have a list of email addresses. 

Goal: Extract the username (part before the "@" symbol) from each email address.

In [12]:
email_list = [
    "john.doe@example.com",
    "jane_smith123@gmail.com",
    "alex-123@company.org",
    "samuel42@yahoo.com",
    "emily.miller@example.net"
]

In [14]:
usernames = []
for i in email_list:
    username = i.split('@')[0]
    usernames.append(username)

In [15]:
for username in usernames:
    print(username)

john.doe
jane_smith123
alex-123
samuel42
emily.miller

 3. Simple Conditional Statements 

Scenario: You have a list of product prices and a discount percentage. 

Goal: Write code to calculate the final price for each product after applying the discount.

In [16]:
product_prices = [20, 30, 15, 25, 10]
discount_percentage = 10

In [18]:
finalprices = []
for price in product_prices:
    discount_price = (discount_percentage / 100) * price
    final_price = price - discount_price
    finalprices.append(final_price)

In [19]:
for finalprice in finalprices:
    print(finalprice)

18.0
27.0
13.5
22.5
9.0

4. Sorting Data 

Scenario: You have a DataFrame containing product information with prices and ratings. 

Goal: Sort the DataFrame by: 

Price (ascending order - cheapest to most expensive). 

Rating (descending order - highest to lowest rating).

In [20]:
task4 = pd.read_csv('task4data.csv')

In [24]:
 task4

      Product  Price  Rating
0      Laptop    800     4.5
1  Smartphone    500     4.2
2  Headphones    100     4.8
3      Tablet    300     3.9
4  Smartwatch    250     4.1

In [22]:
task4data = pd.DataFrame(task4)

In [23]:
task4data

      Product  Price  Rating
0      Laptop    800     4.5
1  Smartphone    500     4.2
2  Headphones    100     4.8
3      Tablet    300     3.9
4  Smartwatch    250     4.1

In [26]:
sort_by_price = task4data.sort_values(by='Price')

In [27]:
sort_by_price

      Product  Price  Rating
2  Headphones    100     4.8
4  Smartwatch    250     4.1
3      Tablet    300     3.9
1  Smartphone    500     4.2
0      Laptop    800     4.5

In [31]:
sort_by_rating = task4data.sort_values(by='Rating',ascending=False)

In [32]:
sort_by_rating

      Product  Price  Rating
2  Headphones    100     4.8
0      Laptop    800     4.5
1  Smartphone    500     4.2
4  Smartwatch    250     4.1
3      Tablet    300     3.9

5.
You have a dataset on customer purchases with the following issues: 

Missing values in the "price" column. 

Inconsistent data types (prices might be strings with a currency symbol). 

Inconsistent product names (typos or capitalization). 

Goal: 

Clean and transform the data using pandas functions.

In [ ]:
import pandas as pd
data4 = pd.read_csv('task4data.csv')


data4['Price'].fillna(0, inplace=True)

data4['Price'] = pd.to_numeric(data4['Price'].str.replace('[/$,]', '', regex=True), errors='coerce') 


data4['product_name'] = data4['product_name'].str.lower()  

data4.drop_duplicates(inplace=True)


data4.reset_index(drop=True, inplace=True)


data4.to_csv('cleaned_data.csv', index=False)